//  Напишите программу, которая принимает на вход число (N) и выдаёт сумму чисел от 1 до N.

Console.Clear();

Console.Write("Введите чило: ");
int a = 
int.Parse(Console.ReadLine()!);
int count = 1;

while (count <= a)
{
    
}
