#Напишите программу, которая принимает на вход строку, и отслеживает,
# сколько раз каждый символ уже встречался.
# Количество повторов добавляется к символам с помощью постфикса формата _n.

#Input: a a a b c a a d c d d
#Output: a a_1 a_2 b c a_3 a_4 d c_1 d_1 d_2

#Для решения данной задачи используйте функцию .split(

dictionary = {
    "A": 1, "E": 1, "I": 1, "O": 1, "U": 1, "L": 1, "N": 1, "S": 1, "T": 1, "R": 1,
    "D": 2, "G": 2,
    "B": 3, "C": 3, "M": 3, "P": 3,
    "F": 4, "H": 4, "V": 4, "W": 4, "Y": 4,
    "K": 5,
    "J": 8, "X": 8,
    "Q": 10, "Z": 10,
    "А": 1, "Б": 3, "В": 1, "Г": 3, "Д": 2, "Е": 1, "Ё": 3, "Ж": 5, "З": 5, "И": 1, "Й": 4,
    "К": 2, "Л": 2, "М": 2, "Н": 1, "О": 1, "П": 2, "Р": 1, "С": 1, "Т": 1, "У": 2, "Ф": 10,
    "Х": 5, "Ц": 5, "Ч": 5, "Ш": 8, "Щ": 10, "Ъ": 10, "Ы": 4, "Ь": 3, "Э": 8, "Ю": 8, "Я": 3
}

word = (input("введите слово: "))
upper_word = word.upper()
price = 0
for i in upper_word:
    if i in dictionary:
        price += dictionary[i]
print(price)